**<mark>Identity</mark>**

Cú pháp:

> IDENTITY\[(seed,increment)\]

Trong cú pháp này:

- seed là giá trị của hàng đầu tiên được tải vào bảng.
- increment (số gia tăng) là giá trị gia tăng được thêm vào giá trị nhận dạng của hàng trước đó.

Giá trị mặc định của seed và giá trị gia tăng là 1, tức là (1,1). Nó có nghĩa là hàng đầu tiên, được tải vào bảng, sẽ có giá trị là một, hàng thứ hai sẽ có giá trị là 2, v.v.

In [ ]:
-- Create a new schema named hr:
CREATE SCHEMA hr

In [ ]:
-- The following statement creates a new table using the IDENTITY property for the personal identification number column:
CREATE TABLE hr.person (
    person_id INT IDENTITY(1,1) PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    gender CHAR(1) NOT NULL
)

In [ ]:
-- First, insert a new row into the person table:
INSERT INTO hr.person(first_name, last_name, gender)
OUTPUT inserted.person_id
VALUES('John','Doe', 'M')

In [ ]:
-- Second, insert another row into the person table:
INSERT INTO hr.person(first_name, last_name, gender)
OUTPUT inserted.person_id
VALUES('Jane','Doe','F')

<mark>**Reset identity**</mark>

> CÁCH 1 (thay đổi IDENT dòng cuối)
> 
> DBCC CHECKIDENT ('table\_name', RESEED, new\_value)
> 
> CÁCH 2 :
> 
> SET DENTITY\_INSERT table\_name ON;
> 
> INSERT INTO table\_name (colunm lists) VALUES (new\_value,value\_lists)
> 
> SET DENTITY\_INSERT table\_name OFF;

In [1]:
DBCC CHECKIDENT ('hr.person', RESEED, 1)

: Msg 2501, Level 16, State 45, Line 1
Cannot find a table or object with the name "hr.person". Check the system catalog.

**<mark>SELECT INTO</mark>**

<span style="font-size: 14px;">Câu lệnh SELECT INTO tạo một bảng mới và chèn các hàng từ truy vấn vào đó.</span>

Câu lệnh SELECT INTO sau tạo bảng đích và sao chép các hàng thỏa mãn điều kiện WHERE, từ bảng nguồn sang bảng đích

> <span style="font-size: 14px;">SELECT&nbsp;</span> 
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; select_list</span>
> 
> <span style="font-size: 14px;">INTO&nbsp;</span> 
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; destination</span>
> 
> <span style="font-size: 14px;">FROM&nbsp;</span> 
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; source</span>
> 
> <span style="font-size: 14px;">[WHERE condition]</span>

<span style="font-size: 14px; background-color: yellow;">Lưu ý rằng câu lệnh SELECT INTO không sao chép các ràng buộc như khóa chính và các chỉ mục từ bảng nguồn sang bảng đích.</span>

In [ ]:
-- A) Using SQL Server SELECT INTO to copy table within the same database example
-- First, create a new schema for storing the new table.
CREATE SCHEMA marketing
GO

In [ ]:
-- Second, create the marketing.customers table like the sales.customers table 
-- and copy all rows from the sales.customers table to the marketing.customers table:
SELECT 
    *
INTO 
    marketing.customers
FROM 
    sales.customers

In [ ]:
-- Third, query data from the the marketing.customers table to verify the copy:
SELECT 
    *
FROM 
    marketing.customers

In [ ]:
-- B) Using SQL Server SELECT INTO statement to copy table across databases
CREATE DATABASE TestDb
GO

In [ ]:
SELECT    
    customer_id, 
    first_name, 
    last_name, 
    email
INTO 
    TestDb.dbo.customers
FROM    
    sales.customers
WHERE 
    state = 'CA'

In [ ]:
SELECT 
    * 
FROM 
    TestDb.dbo.customers

**<mark>INSERT</mark>**

Cú pháp:

> <span style="font-size: 14px;">INSERT INTO table_name (column_list)</span>
> 
> <span style="font-size: 14px;">VALUES (value_list)</span>

<span style="font-size: 14px;">Để thêm nhiều hàng vào bảng cùng một lúc, bạn sử dụng biểu mẫu sau của câu lệnh INSERT:</span>

> <span style="font-size: 14px;">INSERT INTO table_name (column_list)</span>
> 
> <span style="font-size: 14px;">VALUES</span>
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; (value_list_1),</span>
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; (value_list_2),</span>
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; ...</span>
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; (value_list_n)</span>

<span style="font-size: 14px; background-color: yellow;">Số hàng mà bạn có thể chèn cùng một lúc là 1.000 hàng bằng cách sử dụng biểu mẫu này của câu lệnh INSERT. Nếu bạn muốn chèn nhiều hàng hơn thế, bạn nên cân nhắc sử dụng nhiều câu lệnh INSERT, BULK INSERT hoặc một bảng dẫn xuất.</span>

Lưu ý rằng cú pháp CHÈN nhiều hàng này chỉ được hỗ trợ trong SQL Server 2008 trở lên.

Để chèn nhiều hàng được trả về từ một câu lệnh SELECT, bạn sử dụng câu lệnh INSERT INTO SELECT.

> INSERT  \[ TOP ( expression ) \[ PERCENT \] \] 
> 
> INTO target\_table (column\_list)
> 
> query

<span style="font-size: 14px;">Trong cú pháp này:</span>

- <span style="font-size: 14px;">Câu lệnh sẽ chèn các hàng được trả về bởi truy vấn vào target_table.</span>
- <span style="font-size: 14px;">Truy vấn là bất kỳ câu lệnh SELECT hợp lệ nào lấy dữ liệu từ các bảng khác. Nó phải trả về các giá trị tương ứng với các cột được chỉ định trong column_list.</span>
- Phần mệnh đề TOP là tùy chọn. Nó cho phép bạn chỉ định số hàng được trả về bởi truy vấn sẽ được chèn vào bảng đích. Nếu bạn sử dụng tùy chọn PERCENT, câu lệnh sẽ chèn phần trăm hàng thay thế. Lưu ý rằng cách tốt nhất là luôn sử dụng mệnh đề TOP với mệnh đề ORDER BY.

<span style="font-size: 14px;">Ví dụ về câu lệnh INSERT</span>

In [ ]:
-- Let’s create a new table named promotions for the demonstration:
CREATE TABLE sales.promotions (
    promotion_id INT PRIMARY KEY IDENTITY (1, 1),
    promotion_name VARCHAR (255) NOT NULL,
    discount NUMERIC (3, 2) DEFAULT 0,
    start_date DATE NOT NULL,
    expired_date DATE NOT NULL
)

In [ ]:
-- 1) Basic INSERT example
-- The following statement inserts a new row into the promotions table:
INSERT INTO sales.promotions (
    promotion_name,
    discount,
    start_date,
    expired_date
)
VALUES
    (
        '2018 Summer Promotion',
        0.15,
        '20180601',
        '20180901'
    )

In [ ]:
-- To verify the insert operation, you use the following query:
SELECT
    promotion_name,
    discount,
    start_date,
    expired_date
FROM
    sales.promotions

In [ ]:
-- 2) Insert and return inserted values
-- To capture the inserted values, you use the OUTPUT clause. 
-- For example, the following statement inserts a new row into the promotions table and returns the inserted value of the promotion_id column:
INSERT INTO sales.promotions (
    promotion_name,
    discount,
    start_date,
    expired_date
) OUTPUT inserted.promotion_id
VALUES
(
    '2018 Fall Promotion',
    0.15,
    '20181001',
    '20181101'
)

In [ ]:
-- To capture inserted values from multiple columns, you specify the columns in the output as shown in the following statement:
INSERT INTO sales.promotions (
    promotion_name,
    discount,
    start_date,
    expired_date
) OUTPUT inserted.promotion_id,
 inserted.promotion_name,
 inserted.discount,
 inserted.start_date,
 inserted.expired_date
VALUES
(
    '2018 Winter Promotion',
    0.2,
    '20181201',
    '20190101'
)

In [ ]:
-- 3) Insert explicit values into the identity column
INSERT INTO sales.promotions (
    promotion_id,
    promotion_name,
    discount,
    start_date,
    expired_date
) OUTPUT inserted.promotion_id
VALUES
(
    4,
    '2019 Spring Promotion',
    0.25,
    '20190201',
    '20190301'
)

In [ ]:
-- Let’s execute the following statements to insert a value for the identity column in the promotions table:
SET IDENTITY_INSERT sales.promotions ON
GO

INSERT INTO sales.promotions (
    promotion_id,
    promotion_name,
    discount,
    start_date,
    expired_date
)
VALUES
(
    4,
    '2019 Spring Promotion',
    0.25,
    '20190201',
    '20190301'
)
GO


SET IDENTITY_INSERT sales.promotions OFF
GO

Ví dụ về câu lệnh INSERT <span style="font-size: 14px;">nhiều hàng</span>

In [ ]:
INSERT INTO sales.promotions (
    promotion_name,
    discount,
    start_date,
    expired_date
)
VALUES
(
    '2019 Summer Promotion',
    0.15,
    '20190601',
    '20190901'
),
(
    '2019 Fall Promotion',
    0.20,
    '20191001',
    '20191101'
),
(
    '2019 Winter Promotion',
    0.25,
    '20191201',
    '20200101'
)

In [ ]:
SELECT
    promotion_name,
    discount,
    start_date,
    expired_date
FROM
    sales.promotions

Ví dụ về câu lệnh INSERT SELECT INTO

In [ ]:
-- Let’s create a table named addresses
CREATE TABLE sales.addresses (
    address_id INT IDENTITY PRIMARY KEY,
    street VARCHAR (255) NOT NULL,
    city VARCHAR (50),
    state VARCHAR (25),
    zip_code VARCHAR (5)
)

In [ ]:
-- 1) Insert all rows from another table example
-- The following statement inserts all addresses from the customers table into the addresses table:
INSERT INTO sales.addresses (street, city, state, zip_code) 
SELECT
    street,
    city,
    state,
    zip_code
FROM
    sales.customers
ORDER BY
    first_name,
    last_name

In [ ]:
SELECT
    street,
    city,
    state,
    zip_code
FROM
    sales.addresses

In [ ]:
-- Using WHERE
INSERT INTO 
    sales.addresses (street, city, state, zip_code) 
SELECT
    street,
    city,
    state,
    zip_code
FROM
    sales.stores
WHERE
    city IN ('Santa Cruz', 'Baldwin')

In [ ]:
-- Insert the top N of rows
INSERT TOP (10) 
INTO sales.addresses (street, city, state, zip_code) 
SELECT
    street,
    city,
    state,
    zip_code
FROM
    sales.customers
ORDER BY
    first_name,
    last_name

**<mark>UPDATE</mark>**

Cú pháp:

> <span style="font-size: 14px;">UPDATE table_name</span>
> 
> <span style="font-size: 14px;">SET c1 = v1, c2 = v2, ... cn = vn</span>
> 
> <span style="font-size: 14px;">[WHERE condition]</span>

<span style="font-size: 14px;">Trong cú pháp này:</span>

- Đầu tiên, chỉ định tên của bảng mà từ đó dữ liệu sẽ được cập nhật.
- <span style="font-size: 14px;">Thứ hai, chỉ định danh sách cột c1, c2,…, cn và các giá trị v1, v2,… vn sẽ được cập nhật.</span>
- <span style="font-size: 14px;">Thứ ba, chỉ định các điều kiện trong mệnh đề WHERE để chọn các hàng được cập nhật. Mệnh đề WHERE là tùy chọn. Nếu bạn bỏ qua mệnh đề WHERE, tất cả các hàng trong bảng sẽ được cập nhật.</span>

In [ ]:
-- First, create a new table named taxes
CREATE TABLE sales.taxes (
	tax_id INT PRIMARY KEY IDENTITY (1, 1),
	state VARCHAR (50) NOT NULL UNIQUE,
	state_tax_rate DEC (3, 2),
	avg_local_tax_rate DEC (3, 2),
	combined_rate AS state_tax_rate + avg_local_tax_rate,
	max_local_tax_rate DEC (3, 2),
	updated_at datetime
)

In [ ]:
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Alabama',0.04,0.05,0.07);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Alaska',0,0.01,0.07);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Arizona',0.05,0.02,0.05);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Arkansas',0.06,0.02,0.05);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('California',0.07,0.01,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Colorado',0.02,0.04,0.08);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Connecticut',0.06,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Delaware',0,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Florida',0.06,0,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Georgia',0.04,0.03,0.04);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Hawaii',0.04,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Idaho',0.06,0,0.03);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Illinois',0.06,0.02,0.04);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Indiana',0.07,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Iowa',0.06,0,0.01);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Kansas',0.06,0.02,0.04);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Kentucky',0.06,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Louisiana',0.05,0.04,0.07);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Maine',0.05,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Maryland',0.06,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Massachusetts',0.06,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Michigan',0.06,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Minnesota',0.06,0,0.01);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Mississippi',0.07,0,0.01);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Missouri',0.04,0.03,0.05);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Montana',0,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Nebraska',0.05,0.01,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Nevada',0.06,0.01,0.01);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('New Hampshire',0,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('New Jersey',0.06,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('New Mexico',0.05,0.02,0.03);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('New York',0.04,0.04,0.04);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('North Carolina',0.04,0.02,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('North Dakota',0.05,0.01,0.03);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Ohio',0.05,0.01,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Oklahoma',0.04,0.04,0.06);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Oregon',0,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Pennsylvania',0.06,0,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Rhode Island',0.07,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('South Carolina',0.06,0.01,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('South Dakota',0.04,0.01,0.04);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Tennessee',0.07,0.02,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Texas',0.06,0.01,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Utah',0.05,0,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Vermont',0.06,0,0.01);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Virginia',0.05,0,0);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Washington',0.06,0.02,0.03);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('West Virginia',0.06,0,0.01);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Wisconsin',0.05,0,0.01);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('Wyoming',0.04,0.01,0.02);
INSERT INTO sales.taxes(state,state_tax_rate,avg_local_tax_rate,max_local_tax_rate) VALUES('D.C.',0.05,0,0);

In [ ]:
-- 1) Update a single column in all rows example
UPDATE sales.taxes
SET updated_at = GETDATE()

In [ ]:
SELECT 
    tax_id,
    state,
    state_tax_rate,
    avg_local_tax_rate,
    combined_rate,
    max_local_tax_rate,
    updated_at
FROM sales.taxes;

In [ ]:
-- 2) Update multiple columns example
UPDATE sales.taxes
SET max_local_tax_rate += 0.02,
    avg_local_tax_rate += 0.01
WHERE
    max_local_tax_rate = 0.01

In [ ]:
SELECT 
    tax_id,
    state,
    state_tax_rate,
    avg_local_tax_rate,
    combined_rate,
    max_local_tax_rate,
    updated_at
FROM sales.taxes;

**<mark>UPDATE JOIN</mark>**

<span style="font-size: 14px;">Để truy vấn dữ liệu từ các bảng có liên quan, bạn thường sử dụng các mệnh đề nối, hoặc phép nối bên trong hoặc phép nối bên trái. Trong SQL Server, bạn có thể sử dụng các mệnh đề nối này trong câu lệnh CẬP NHẬT để thực hiện cập nhật bảng chéo.</span>

> <span style="font-size: 14px;">UPDATE&nbsp;</span> 
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; t1</span>
> 
> <span style="font-size: 14px;">SET&nbsp;</span> 
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; t1.c1 = t2.c2,</span>
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; t1.c2 = expression,</span>
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; ...&nbsp; &nbsp;</span> 
> 
> <span style="font-size: 14px;">FROM&nbsp;</span> 
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; t1</span>
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; [INNER | LEFT] JOIN t2 ON join_predicate</span>
> 
> <span style="font-size: 14px;">WHERE&nbsp;</span> 
> 
>  <span style="font-size: 14px;">&nbsp; &nbsp; where_predicate</span>

<span style="font-size: 14px;">Trong cú pháp này:</span>

- Đầu tiên, chỉ định tên của bảng (t1) mà bạn muốn cập nhật trong mệnh đề UPDATE.
- <span style="font-size: 14px;">Tiếp theo, chỉ định giá trị mới cho mỗi cột của bảng được cập nhật.</span>
- <span style="font-size: 14px;">Sau đó, chỉ định lại bảng mà bạn muốn cập nhật trong mệnh đề FROM.</span>
- <span style="font-size: 14px;">Sau đó, sử dụng INNER JOIN hoặc LEFT JOIN để tham gia vào một bảng khác (t2) bằng cách sử dụng một vị từ nối được chỉ định sau từ khóa ON.</span>
- <span style="font-size: 14px;">Cuối cùng, thêm một mệnh đề WHERE tùy chọn để chỉ định các hàng sẽ được cập nhật.</span>

In [ ]:
-- Setting up sample tables
DROP TABLE IF EXISTS sales.targets

CREATE TABLE sales.targets
(
    target_id  INT	PRIMARY KEY, 
    percentage DECIMAL(4, 2) 
        NOT NULL DEFAULT 0
)

INSERT INTO 
    sales.targets(target_id, percentage)
VALUES
    (1,0.2),
    (2,0.3),
    (3,0.5),
    (4,0.6),
    (5,0.8)

In [ ]:
CREATE TABLE sales.commissions
(
    staff_id    INT PRIMARY KEY, 
    target_id   INT, 
    base_amount DECIMAL(10, 2) 
        NOT NULL DEFAULT 0, 
    commission  DECIMAL(10, 2) 
        NOT NULL DEFAULT 0, 
    FOREIGN KEY(target_id) 
        REFERENCES sales.targets(target_id), 
    FOREIGN KEY(staff_id) 
        REFERENCES sales.staffs(staff_id),
)

INSERT INTO 
    sales.commissions(staff_id, base_amount, target_id)
VALUES
    (1,100000,2),
    (2,120000,1),
    (3,80000,3),
    (4,900000,4),
    (5,950000,5)

In [ ]:
-- A) SQL Server UPDATE INNER JOIN example
UPDATE
    sales.commissions
SET
    sales.commissions.commission = 
        c.base_amount * t.percentage
FROM 
    sales.commissions c
    INNER JOIN sales.targets t
        ON c.target_id = t.target_id

In [ ]:
SELECT 
    *
FROM 
    sales.commissions

In [ ]:
-- B) SQL Server UPDATE LEFT JOIN example
-- Suppose we have two more new sales staffs that have just joined and they don’t have any target yet:
INSERT INTO 
    sales.commissions(staff_id, base_amount, target_id)
VALUES
    (6,100000,NULL),
    (7,120000,NULL)

In [ ]:
UPDATE 
    sales.commissions
SET  
    sales.commissions.commission = 
        c.base_amount  * COALESCE(t.percentage,0.1)
FROM  
    sales.commissions c
    LEFT JOIN sales.targets t 
        ON c.target_id = t.target_id

In [ ]:
SELECT 
  * 
FROM 
    sales.commissions

**<mark>DELETE</mark>**

Cú pháp:

> <span style="font-size: 14px;">DELETE [ TOP ( expression ) [ PERCENT ] ]&nbsp;&nbsp;</span> 
> 
> <span style="font-size: 14px;">FROM table_name</span>
> 
> <span style="font-size: 14px;">[WHERE search_condition]</span>

In [ ]:
-- The following statement creates a table named production.product_history with the data copied from the production.products table:
SELECT * 
INTO production.product_history
FROM
    production.products

In [ ]:
SELECT * FROM production.product_history

In [ ]:
-- 1) Delete the number of random rows example
DELETE TOP (21)
FROM production.product_history

In [ ]:
-- 2) Delete the percent of random rows example
DELETE TOP (5) PERCENT
FROM production.product_history

In [ ]:
-- 3) Delete some rows with a condition example
DELETE
FROM
    production.product_history
WHERE
    model_year = 2017

In [ ]:
-- 4) Delete all rows from a table example
DELETE FROM  production.product_history

**<mark>TRUNCATE TABLE</mark>**

In [ ]:
CREATE TABLE sales.customer_groups (
    group_id INT PRIMARY KEY IDENTITY,
    group_name VARCHAR (50) NOT NULL
);

INSERT INTO sales.customer_groups (group_name)
VALUES
    ('Intercompany'),
    ('Third Party'),
    ('One time')

In [ ]:
DELETE FROM sales.customer_groups

Cú pháp:

> <span style="font-size: 14px;">TRUNCATE TABLE [database_name.][schema_name.]table_name</span>

<span style="font-size: 14px;">Trong cú pháp này, trước tiên, bạn chỉ định tên của bảng mà bạn muốn xóa tất cả các hàng. Thứ hai, tên cơ sở dữ liệu là tên của cơ sở dữ liệu mà bảng được tạo. Tên cơ sở dữ liệu là tùy chọn. Nếu bạn bỏ qua nó, câu lệnh sẽ xóa bảng trong cơ sở dữ liệu hiện được kết nối.</span>

In [ ]:
INSERT INTO sales.customer_groups (group_name)
VALUES
    ('Intercompany'),
    ('Third Party'),
    ('One time')

TRUNCATE TABLE sales.customer_groups

<span style="font-size: 14px;">TRUNCATE TABLE tương tự như câu lệnh DELETE không có mệnh đề WHERE. Tuy nhiên, câu lệnh TRUNCATE thực thi nhanh hơn và sử dụng ít tài nguyên hệ thống và nhật ký giao dịch hơn.</span>